; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v2)
		(pred_6 ?v4)
		(pred_5 ?v3)
		(pred_3 ?v3)
		(pred_4 ?v4 ?v3)
		(pred_1)
		(pred_2 ?v4))

   (:action op_1
       :parameters  (?v7 ?v6)
       :precondition (and (not-eq ?v7 ?v6) 
                          (pred_5 ?v7) (pred_5 ?v6) (pred_3 ?v7))
       :effect (and  (pred_3 ?v6)
		     (not (pred_3 ?v7))))


   (:action op_2
       :parameters (?v5 ?v8)
       :precondition  (and  (pred_6 ?v5) (pred_5 ?v8)
			    (pred_4 ?v5 ?v8) (pred_3 ?v8) (pred_1))
       :effect (and (pred_2 ?v5)
		    (not (pred_4 ?v5 ?v8)) 
		    (not (pred_1))))

   (:action op_3
       :parameters  (?v5  ?v8)
       :precondition  (and  (pred_6 ?v5) (pred_5 ?v8)
			    (pred_2 ?v5) (pred_3 ?v8))
       :effect (and (pred_4 ?v5 ?v8)
		    (pred_1)
		    (not (pred_2 ?v5)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_03 obj_04 obj_02 
          obj_01 obj_05 
)
(:init
(pred_5 obj_03)
(pred_5 obj_04)
(pred_5 obj_02)
(pred_6 obj_01)
(pred_6 obj_05)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(pred_1)
(pred_4 obj_01 obj_03)
(pred_4 obj_05 obj_03)
(pred_3 obj_04)
)
(:goal
(and
(pred_4 obj_01 obj_03)
(pred_4 obj_05 obj_04)
)
)

(:constraints
  (sometime-before  (pred_4 obj_05 obj_04) (pred_3 obj_02))
)
)

; plan
1. (op_1 obj_04 obj_03)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_03)
   goals met: 1 of 2
2. (op_2 obj_01 obj_03)
   deleted: (pred_4 obj_01 obj_03) (pred_1)
   added: (pred_2 obj_01)
   goals met: 0 of 2
3. (op_1 obj_03 obj_02)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_02)
   goals met: 0 of 2
4. (op_3 obj_01 obj_02)
   deleted: (pred_2 obj_01)
   added: (pred_4 obj_01 obj_02) (pred_1)
   goals met: 0 of 2
5. (op_1 obj_02 obj_03)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_03)
   goals met: 0 of 2
6. (op_2 obj_05 obj_03)
   deleted: (pred_4 obj_05 obj_03) (pred_1)
   added: (pred_2 obj_05)
   goals met: 0 of 2
7. (op_1 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_04)
   goals met: 0 of 2
8. (op_3 obj_05 obj_04)
   deleted: (pred_2 obj_05)
   added: (pred_4 obj_05 obj_04) (pred_1)
   goals met: 1 of 2
9. (op_1 obj_04 obj_02)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_02)
   goals met: 1 of 2
10. (op_2 obj_01 obj_02)
   deleted: (pred_4 obj_01 obj_02) (pred_1)
   added: (pred_2 obj_01)
   goals met: 1 of 2
11. (op_1 obj_02 obj_03)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_03)
   goals met: 1 of 2
12. (op_3 obj_01 obj_03)
   deleted: (pred_2 obj_01)
   added: (pred_4 obj_01 obj_03) (pred_1)
   goals met: 2 of 2
